{"0": "Name: Antoine Bertin\nAge: 35 years old\nOccupation: Data Scientist, Former Sommelier & Blockchain Enthusiast\nLink to schedule a call: [https://calendly.com/antoinebertin/30](https://calendly.com/antoinebertin/30)\nEmail: [antoinebe35gmail.com](mailto:antoinebe35gmail.com)\nLanguages:\n* French\n* Spanish\n* English\nAbout me:\nHey there! I'm Antoine, a passionate data scientist with a business mindset. I ", "1": "dream of a world where solving challenges is as simple as running a pip install command. \nRun '𝒑𝒊𝒑 𝒊𝒏𝒔𝒕𝒂𝒍𝒍 𝒂𝒏𝒕𝒐𝒊𝒏𝒆' now in your terminal and execute the command ‘𝒉𝒊𝒓𝒆_𝒂𝒏𝒕𝒐𝒊𝒏𝒆’.\nIf you want to contribute to the 'antoine' package and make me better, check out my GitHub: [http://github.com/monolok/antoine](http://github.com/monolok/antoine)\nSkills:\n* Project Management\n* Business Development\n* Proces", "2": "s Improvement\n* Process Automation\n* Cluster Analysis\n* System Deployment\n* Prediction\n* Deep Learning\n* Machine Learning\n* Big Data\n* Big Data Analytics\n* Data Mining\n* Data Modeling\n* Algorithms\n* Machine Learning Algorithms\n* Artiﬁcial Intelligence (AI)\n* Blockchain\n* Non-Fungible Tokens (NFTs)\n* Python (Programming Language)\n* Web Development\n*Databases\n*Teaching\n*Consulting\n*Training\nPresent ", "3": "experience:\nPractice Tutor - Machine & Deep Learning\nJedha Bootcamp · FreelanceJedha Bootcamp · Freelance\nJun 2024 - Present\nParis, Île-de-France, France · On-site\n𝐉𝐞𝐝𝐡𝐚 𝐡𝐚𝐬 𝐞𝐬𝐭𝐚𝐛𝐥𝐢𝐬𝐡𝐞𝐝 𝐢𝐭𝐬𝐞𝐥𝐟 𝐚𝐬 𝐭𝐡𝐞 𝐥𝐞𝐚𝐝𝐢𝐧𝐠 𝐬𝐜𝐡𝐨𝐨𝐥 𝐟𝐨𝐫 𝐭𝐫𝐚𝐢𝐧𝐢𝐧𝐠 𝐢𝐧 𝐃𝐚𝐭𝐚. In 2024, Jedha was awarded the title of best coding BootCamp by Course Report.\n𝐌𝐲 𝐚𝐜𝐡𝐢𝐞𝐯𝐞𝐦𝐞𝐧𝐭𝐬:\n* Assisting students with practice exercises and case studies: \n\n\nI", "4": " worked closely with students to help them apply machine learning and deep learning concepts to real-world problems. I provided guidance and feedback to help students improve their problem-solving skills and deepen their understanding of key concepts.\n*Explaining code and technical concepts: I helped students understand the code used in machine learning and deep learning models, explaining complex", "5": " technical concepts in clear and accessible language. I also provided support with debugging and troubleshooting code.\n*Skills: Teaching · Consulting · Project Planning · Machine Learning · Deep Learning · Artiﬁcial Intelligence (AI), Training\nExperience and jobs:\nAI Consultant & Product Owner at CloprNFT\nMarch 2022 - March 2024 (2 years 1 month)\nWorldwide\nClopr's web3 mining dApp enables one-clic", "6": "k generation of token-bound derivatives using CloprBottle NFTs, adding utility to your NFTs. (<https://app.cloprnft.com/>)\nMy achievements:\n* Coordinated a global tech pipeline across the USA, Georgia, France, and Argentina, leading teams to integrate blockchain and AI. Managed the lifecycle of the blockchain application from inception to launch, ensuring product cohesion.\n* Devised a data collect", "7": "ion strategy by working with Hollywood scriptwriters to develop a standardized story template for eﬃcient data mining. This enabled eﬀective AI model ﬁne-tuning.\n* Led the integration of AI technology with blockchain and spearheaded the deployment of smart contracts co-authored by myself. This resulted in the creation of a groundbreaking platform for generating token-bound derivatives within the N", "8": "FT ecosystem.\n* Crafted comprehensive whitepapers and technical speciﬁcations, streamlining regulatory compliance and legal clarity for users. This facilitated trademark registration and deﬁned platform terms and conditions.\n* Implemented streamlined feedback processes by automating user feedback mechanisms to encompass the entirety of the tech pipeline and beyond. This ensured that no valuable in", "9": "formation was overlooked, providing insights crucial for understanding and prioritizing tech initiatives eﬀectively.\nFounder and Former CEO (Restaurant sold) at Galette Café Saint Germain\nSelf-employed · Sep 2012 - Dec 2023 · 11 yrs 4 mos · On-site\n2 rue de l'université, Paris, France\n\"Galette Café\" is nestled in the heart of Paris, embodying the essence of Breton cuisine. Our mission is to honor ", "10": "the culinary heritage of Brittany by showcasing the ﬁnest organic, artisanal products sourced from local producers.\nMy achievements:\n* Built a Concept from Scratch: I conceptualized and established Galette Café, laying its foundation from the ground up.\n* Built a Reputation: My dedication to excellence garnered us multiple prestigious awards, including the coveted \"Best Restaurant\" recognition fro", "11": "m Trip Advisor.\n* Built an Anti-Fragile Business: Amidst social and economic challenges, Galette Café stood resilient, navigating through uncertainties with grace.\n* Not Afraid of Pivoting: Adapting to evolving consumer trends and technological advancements, I ensured Galette Café remained at the forefront of the market.\n* Sustained Business Growth: Over a span of 12 years, I sustained consistent ", "12": "growth and proﬁtability.\n* Staﬀ Cohesion: Fostering a cohesive team environment, I nurtured a dedicated workforce, achieving remarkable staﬀ retention rates and fostering a positive workplace culture.\n\n\nOld Managerial Experiences:\nFood & Beverage at The Little Nell\nNov 2015 - Nov 2017 · 2 yrs 1 mo · Aspen, Colorado\nFood & Beverage at InterContinental Hotels Group\nJan 2010 - Jan 2011 · 1 yr 1 mo · ", "13": "Nicaragua, Managua\nFood & Beverage at The Little Nell\nNov 2008 - Nov 2009 · 1 yr 1 mo · Aspen, Colorado\nEducation:\nJedha Bootcamp\nMaster's degree, Artiﬁcial Intelligence\nGrade: Full stack data science & engineering program grade: Full stack data science & engineering program\n📌 𝐃𝐚𝐭𝐚 & 𝐁𝐢𝐠 𝐃𝐚𝐭𝐚:\nDatabases: PostgreSQL, MySQL\nData transfer & cloud services: ETL | AWS | GCP\nWeb Scraping: BeautifulSoup,", "14": " Scrapy\nBig data: Spark, Databricks\n📌 𝐄𝐃𝐀:\nStatistics and Probability\nData viz & Data mining\nLibraries: Matplotlib, Seaborn, Plotly\n📌 𝐌𝐋 & 𝐃𝐞𝐞𝐩 𝐥𝐞𝐚𝐫𝐧𝐢𝐧𝐠 𝐦𝐨𝐝𝐞𝐥 𝐜𝐫𝐞𝐚𝐭𝐢𝐨𝐧:\nLibraries: Pandas, Numpy, Scikit-Learn, Keras, TensorFlow, Spacy, Word2Vec, Langchain, HuggingFace\nSupervised ML: Linear & Logistic Regressions, Ensemble learning, SVM\nUnsupervised ML: Clustering algorithms with KMeans, DBscan\nDime", "15": "nsionality Reduction: PCA, LSA\nRegularization: lasso, ridge, elastic net\nDeep Learning: RNN, CNN, GRU & LSTM, GAN, transformers\n📌 𝐋𝐞𝐯𝐞𝐫𝐚𝐠𝐢𝐧𝐠 𝐨𝐩𝐞𝐧 𝐬𝐨𝐮𝐫𝐜𝐞 𝐦𝐨𝐝𝐞𝐥𝐬:\nTransfer learning & Fine-tuning\nTraining big models with LoRA and QLoRA\nRAG tasks: Vector databases with Pinecone, chroma\n📌 𝐃𝐞𝐩𝐥𝐨𝐲 𝐀𝐏𝐈 & 𝐀𝐩𝐩, 𝐦𝐨𝐧𝐢𝐭𝐨𝐫𝐢𝐧𝐠:\nDocker, MLﬂow, Amazon S3 & EC2, Streamlit, Heroku, FastAPI\n📌 𝐃𝐚𝐭𝐚 & 𝐁𝐢𝐠 𝐃𝐚𝐭𝐚: Databas", "16": "es: PostgreSQL, MySQL Data transfer & cloud services: ETL | AWS | GCP Web Scraping: BeautifulSoup, Scrapy Big data: Spark, Databricks \n📌 𝐄𝐃𝐀: Statistics and Probability Data viz & Data mining Libraries: Matplotlib, Seaborn, Plotly \n📌 𝐌𝐋 & 𝐃𝐞𝐞𝐩 𝐥𝐞𝐚𝐫𝐧𝐢𝐧𝐠 𝐦𝐨𝐝𝐞𝐥 𝐜𝐫𝐞𝐚𝐭𝐢𝐨𝐧: Libraries: Pandas, Numpy, Scikit-Learn, Keras, TensorFlow, Spacy, Word2Vec, Langchain, HuggingFace Supervised ML: Linear & Logistic", "17": " Regressions, Ensemble learning, SVM Unsupervised ML: Clustering algorithms with KMeans, DBscan Dimensionality Reduction: PCA, LSA Regularization: lasso, ridge, elastic net Deep Learning: RNN, CNN, GRU & LSTM, GAN, transformers \n📌 𝐋𝐞𝐯𝐞𝐫𝐚𝐠𝐢𝐧𝐠 𝐨𝐩𝐞𝐧 𝐬𝐨𝐮𝐫𝐜𝐞 𝐦𝐨𝐝𝐞𝐥𝐬: Transfer learning & Fine-tuning Training big models with LoRA and QLoRA RAG tasks: Vector databases with Pinecone, chroma \n📌 𝐃𝐞𝐩𝐥𝐨𝐲 𝐀𝐏𝐈 & ", "18": "𝐀𝐩𝐩, 𝐦𝐨𝐧𝐢𝐭𝐨𝐫𝐢𝐧𝐠: Docker, MLﬂow, Amazon S3 & EC2, Streamlit, Heroku, FastAPI\n\n\nSkills: Machine Learning · Cluster Analysis · Big Data · Big Data Analytics · Artiﬁcial Intelligence (AI) · Deep Learning · Data · Algorithms · Data Modeling · Data Mining\nGlion Institute of Higher Education\nBachelor of Applied Science (B.A.Sc.), Business Administration and Management · (2008 - 2012)\nUniversidad Europea\n", "19": "Grado en Administración y Dirección de Empresas, Business/Managerial Economics\nLe wagon\nFull stack - Ruby on rails, Computer Science\nLes Roches Bluche International School of Hotel Management Bachelor of Applied Science - BASc\nA fun fact is my high level of wine knowledge Certiﬁcation:\nWine & Spirit Education TrustWine & Spirit Education Trust - WSET 3\nCourt of Master Sommeliers - CMS 2Court of Ma", "20": "ster Sommeliers - CMS 2\n\u2028Projects and works - Machine and deep learning projects I have worked on, all the code can be found in my Github (𝘩𝘵𝘵𝘱𝘴://𝘨𝘪𝘵𝘩𝘶𝘣.𝘤𝘰𝘮/𝘮𝘰𝘯𝘰𝘭𝘰𝘬/𝘢𝘯𝘵𝘰𝘪𝘯𝘦):\nBig Data (Databricks and PySpark) - Steam's videogames platform Big Data (Databricks and PySpark) - Steam's videogames platform\nAssociated with Jedha BootcampAssociated with Jedha Bootcamp\nI conducted a comprehensive analysi", "21": "s of the games available on Steam's marketplace as part of a project for Ubisoft. The goal was to gain insights into the video game ecosystem and current trends, ultimately aiming to understand the factors inﬂuencing a game's popularity or sales globally.\nAt a macro level, I delved into various aspects such as the distribution of games by publishers, the ratings of games, trends in release years i", "22": "ncluding the impact of events like Covid-19, pricing strategies, language representation, and age restrictions. \nFor genre analysis, I explored the most prevalent genres, their review ratios, publishers' genre preferences, and the most lucrative genres.\nAdditionally, I examined platform preferences, determining whether games were predominantly available on Windows/Mac/Linux and if certain genres w", "23": "ere more likely to be found on speciﬁc platforms.\nTo accomplish this, I utilized Databricks and PySpark for data manipulation and analysis. Leveraging PySpark's functionalities such as getField() and explode(), I handled the semi-structured dataset eﬃciently. Furthermore, I employed aggregate functions and groupBy to conduct segmented analysis, ensuring a comprehensive understanding of the data.\nM", "24": "y deliverable includes one or several notebooks showcasing data manipulation with PySpark and data visualization using Databrick's dashboarding tool. I made use of the \"publish\" button on Databricks notebooks to create public URLs for easy access by the jury, adhering to the project guidelines. Links to the published notebooks are available in my GitHub repository for the jury's convenience.I cond", "25": "ucted a comprehensive analysis of the games available on Steam's marketplace as part of a project for Ubisoft. The goal was to gain insights into the video game ecosystem and current trends, ultimately aiming to understand the factors inﬂuencing a game's popularity or sales globally. At a macro level, I delved into various aspects such as the distribution of games by publishers, the ratings of gam", "26": "es, trends in release years including the impact of events like Covid-19, pricing strategies, language representation, and age restrictions. For genre analysis, I explored the most prevalent genres, their review ratios, publishers' genre preferences, and the most lucrative genres. Additionally, I examined platform preferences, determining whether games were predominantly available on Windows/Mac/L", "27": "inux and if certain genres were more likely to be found on speciﬁc platforms. To accomplish this, I utilized Databricks and PySpark for data manipulation and analysis. Leveraging PySpark's functionalities such as getField() and explode(), I handled the semi-structured dataset eﬃciently. Furthermore, I employed aggregate \n\nfunctions and groupBy to conduct segmented analysis, ensuring a comprehensiv", "28": "e understanding of the data. My deliverable includes one or several notebooks showcasing data manipulation with PySpark and data visualization using Databrick's dashboarding tool. I made use of the \"publish\" button on Databricks notebooks to create public URLs for easy access by the jury, adhering to the project guidelines. Links to the published notebooks are available in my GitHub repository for", "29": " the jury's convenience.\nSkills: Big Data · Machine LearningSkills: Big Data · Machine Learning\nDeep Learning (Embedding) - Spam detector for AT&TDeep Learning (Embedding) - Spam detector for AT&T\nAssociated with Jedha BootcampAssociated with Jedha Bootcamp\nI worked on a project with AT&T to address a major concern for their users: spam messages. Despite their manual eﬀorts, AT&T sought an automat", "30": "ed solution to ﬂag spam and protect their users' experience.\nIn this project, I aimed to develop a spam detector solely based on SMS content. To begin, I utilized a provided dataset to train deep-learning models for this purpose.\nFollowing the project scope, I adhered to some helpful guidelines:\n1. Starting Simple: I focused on developing eﬀective models without unnecessary complexity.\n2. Transfer", "31": " Learning: Given the limited dataset, I leveraged transfer learning to tap into the knowledge of pre-trained models trained on vast amounts of data.\nThe project's deliverables can be found in my GitHub and included:\n- A notebook containing preprocessing steps and the training of one or more deep learning models.\n- Clear documentation of the model's performance.I worked on a project with AT&T to ad", "32": "dress a major concern for their users: spam messages. Despite their manual eﬀorts, AT&T sought an automated solution to ﬂag spam and protect their users' experience. In this project, I aimed to develop a spam detector solely based on SMS content. To begin, I utilized a provided dataset to train deep-learning models for this purpose. Following the project scope, I adhered to some helpful guidelines", "33": ": 1. Starting Simple: I focused on developing eﬀective models without unnecessary complexity. 2. Transfer Learning: Given the limited dataset, I leveraged transfer learning to tap into the knowledge of pre-trained models trained on vast amounts of data. The project's deliverables can be found in my GitHub and included: - A notebook containing preprocessing steps and the training of one or more dee", "34": "p learning models. - Clear documentation of the model's performance.\nSkills: Machine Learning · Deep Learning · Artiﬁcial Intelligence (AI)Skills: Machine Learning · Deep Learning · Artiﬁcial Intelligence (AI)\nHollywood Writers, AI and NFT TechnologyHollywood Writers, AI and NFT Technology\nAssociated with CloprNFTAssociated with CloprNFT\nI led the development of CloprNFT as the product owner. Our ", "35": "groundbreaking technology seamlessly integrates stories penned by esteemed Hollywood writers with our cutting-edge in-house AI. Notably, each story is deliberately left open-ended for heightened engagement. What sets us apart is our automated customization process: utilizing computer vision and metadata available on the blockchain, each story is uniquely tailored to the image (NFT) triggering it.I", "36": " led the development of CloprNFT as the product owner. Our groundbreaking technology seamlessly integrates stories penned by esteemed Hollywood writers with our cutting-edge in-house AI. Notably, each story is deliberately left open-ended for heightened engagement. What sets us apart is our automated customization process: utilizing computer vision and metadata available on the blockchain, each st", "37": "ory is uniquely tailored to the image (NFT) triggering it.\nSkills: Project Management · Machine Learning · Blockchain · Artiﬁcial Intelligence (AI)Skills: Project Management · Machine Learning · Blockchain · Artiﬁcial Intelligence (AI)\nClopr - Potion makers of web3Clopr - Potion makers of web3\n\n\nClopr LingoClopr Lingo\nCloprClopr\nSupervised Machine Learning (Classiﬁcation task) - Conversion Rate Pr", "38": "edictionSupervised Machine Learning (Classiﬁcation task) - Conversion Rate Prediction\nAssociated with Jedha BootcampAssociated with Jedha Bootcamp\nFor this project, I embarked on a challenging endeavor in supervised machine learning known as the Conversion Rate Challenge. The goal? To predict whether a user visiting the Data Science Weekly website would subscribe to the newsletter based on various", "39": " user parameters.\nTo tackle this challenge eﬀectively, I followed a structured approach:\n1. Exploratory Data Analysis (EDA) and Preprocessing: I delved into the provided dataset, uncovering insights and patterns to guide my model development. Understanding the data's nuances was crucial for preprocessing and feature engineering.\n2. Baseline Model Training: With data_train.csv in hand, I trained a ", "40": "baseline model, setting the foundation for subsequent improvements. This initial model provided a benchmark against which I could measure enhancements.\n3. Model Enhancement: Armed with insights from EDA, I embarked on enhancing my model's performance. This involved feature engineering, selecting pertinent features, experimenting with various algorithms, and ﬁne-tuning hyperparameters to optimize t", "41": "he model's F1-score.\n4. Prediction and Submission: Once satisﬁed with my model's performance, I utilized data_test.csv to make predictions. These predictions were then compiled into a submission ﬁle for evaluation, contributing to the ongoing leaderboard rankings.\n5. Analysis and Recommendations: Beyond model performance, I delved into analyzing the parameters of my best model. This analysis aimed", "42": " to unearth actionable insights for improving the newsletter's conversion rate. I provided recommendations based on my ﬁndings, potentially identifying new strategies to enhance user engagement.\nThroughout this project, I adhered to the outlined goals:\n- Conducting thorough EDA and preprocessing.\n- Training and evaluating models for conversion prediction.\n- Making submissions to the leaderboard.\n-", "43": " Analyzing model parameters and oﬀering actionable recommendations.\nFind my code in my GitHub.For this project, I embarked on a challenging endeavor in supervised machine learning known as the Conversion Rate Challenge. The goal? To predict whether a user visiting the Data Science Weekly website would subscribe to the newsletter based on various user parameters. To tackle this challenge eﬀectively", "44": ", I followed a structured approach: 1. Exploratory Data Analysis (EDA) and Preprocessing: I delved into the provided dataset, uncovering insights and patterns to guide my model development. Understanding the data's nuances was crucial for preprocessing and feature engineering. 2. Baseline Model Training: With data_train.csv in hand, I trained a baseline model, setting the foundation for subsequent", "45": " improvements. This initial model provided a benchmark against which I could measure enhancements. 3. Model Enhancement: Armed with insights from EDA, I embarked on enhancing my model's performance. This involved feature engineering, selecting pertinent features, experimenting with various algorithms, and ﬁne-tuning hyperparameters to optimize the model's F1-score. 4. Prediction and Submission: On", "46": "ce satisﬁed with my model's performance, I utilized data_test.csv to make predictions. These predictions were then compiled into a submission ﬁle for evaluation, contributing to the ongoing leaderboard rankings. 5. Analysis and Recommendations: Beyond model performance, I delved into analyzing the parameters of my best model. This analysis aimed to unearth actionable insights for improving the new", "47": "sletter's conversion rate. I provided recommendations based on my ﬁndings, potentially identifying new strategies to enhance user engagement. Throughout this project, I adhered to the outlined goals: - Conducting thorough EDA and preprocessing. - Training \n\nand evaluating models for conversion prediction. - Making submissions to the leaderboard. - Analyzing model parameters and oﬀering actionable ", "48": "recommendations. Find my code in my GitHub.\nSkills: Machine LearningSkills: Machine Learning\nSupervised Machine Learning (Regression task) - Weekly sales predictionSupervised Machine Learning (Regression task) - Weekly sales prediction\nAssociated with Jedha BootcampAssociated with Jedha Bootcamp\nI was tasked with spearheading a project for Walmart's marketing service, aiming to construct a robust ", "49": "machine learning model capable of accurately estimating weekly sales in their stores. This endeavor was crucial for Walmart to comprehend the intricate relationship between sales and various economic indicators, thereby aiding in the formulation of informed marketing strategies.\nThe project was meticulously structured into three pivotal phases:\nPart 1: I delved into extensive exploratory data anal", "50": "ysis (EDA) and preprocessing to whip the dataset into shape for machine learning. This involved creating visualizations, computing statistics, and implementing necessary transformations such as handling missing values, feature engineering from the Date column, and addressing outliers.\nPart 2: The cornerstone of this phase was training a linear regression model, serving as our baseline. Following r", "51": "igorous training, I meticulously assessed its performance on both the training and test sets. Moreover, delving into the model's coeﬃcients provided valuable insights into the features driving sales predictions.\nPart 3: To mitigate overﬁtting, I ventured into the realm of regularized regression models. Leveraging scikit-learn's Ridge and Lasso models, I aimed to strike a delicate balance between m", "52": "odel complexity and generalization performance. Additionally, ﬁne-tuning the regularization strength using GridSearchCV ensured optimal model performance.\nThroughout the project, I adhered to Walmart's custom dataset, meticulously navigating through each step outlined in the project's scope and the code can be found in my GitHub.I was tasked with spearheading a project for Walmart's marketing serv", "53": "ice, aiming to construct a robust machine learning model capable of accurately estimating weekly sales in their stores. This endeavor was crucial for Walmart to comprehend the intricate relationship between sales and various economic indicators, thereby aiding in the formulation of informed marketing strategies. The project was meticulously structured into three pivotal phases: Part 1: I delved in", "54": "to extensive exploratory data analysis (EDA) and preprocessing to whip the dataset into shape for machine learning. This involved creating visualizations, computing statistics, and implementing necessary transformations such as handling missing values, feature engineering from the Date column, and addressing outliers. Part 2: The cornerstone of this phase was training a linear regression model, se", "55": "rving as our baseline. Following rigorous training, I meticulously assessed its performance on both the training and test sets. Moreover, delving into the model's coeﬃcients provided valuable insights into the features driving sales predictions. Part 3: To mitigate overﬁtting, I ventured into the realm of regularized regression models. Leveraging scikit-learn's Ridge and Lasso models, I aimed to s", "56": "trike a delicate balance between model complexity and generalization performance. Additionally, ﬁne-tuning the regularization strength using GridSearchCV ensured optimal model performance. Throughout the project, I adhered to Walmart's custom dataset, meticulously navigating through each step outlined in the project's scope and the code can be found in my GitHub.\nSkills: Machine LearningSkills: Ma", "57": "chine Learning\nUnsupervised ML (DBSCAN + Truncated SVD) - Deploying a recommender system & Topic ExtractionUnsupervised ML (DBSCAN + Truncated SVD) - Deploying a recommender system & Topic Extraction\nAssociated with Jedha BootcampAssociated with Jedha Bootcamp\nFor the North Face ecommerce project, I embarked on utilizing unsupervised machine learning techniques to enhance online sales through the ", "58": "company's website. The primary focus was on implementing two major solutions to boost conversion rates.\n\n\nFirstly, I deployed a recommender system aimed at suggesting additional products to users based on their interests. This involved creating a \"you might also be interested by these products...\" section on each product page, enhancing the user experience and potentially increasing sales.\nSecondl", "59": "y, I endeavored to improve the structure of the product catalog by employing topic extraction techniques. The goal was to challenge existing categorizations and identify new categories that could enhance website navigation.\nBreaking down the project into three main steps, I began by identifying groups of products with similar descriptions. This involved preprocessing textual data to clean the corp", "60": "us, encoding the texts with TF-IDF transformation, and training a clustering model using DBSCAN on the TF-IDF matrix.\nSubsequently, I developed a recommender system by utilizing the cluster IDs obtained from the clustering model. This allowed me to suggest similar items to users based on their interests, enhancing the personalized shopping experience.\nFinally, I delved into topic modeling using an", "61": " LSA model to automatically extract latent topics from the product descriptions. This involved training a TruncatedSVD model on the corpus and analyzing the results through wordclouds to gain insights into the underlying themes present in the product descriptions.\nIn conclusion, the project aimed to leverage unsupervised machine learning techniques to optimize the online shopping experience for Th", "62": "e North Face customers, potentially increasing conversion rates and overall sales on the company's website. Find the code in my GitHub.For the North Face ecommerce project, I embarked on utilizing unsupervised machine learning techniques to enhance online sales through the company's website. The primary focus was on implementing two major solutions to boost conversion rates. Firstly, I deployed a ", "63": "recommender system aimed at suggesting additional products to users based on their interests. This involved creating a \"you might also be interested by these products...\" section on each product page, enhancing the user experience and potentially increasing sales. Secondly, I endeavored to improve the structure of the product catalog by employing topic extraction techniques. The goal was to challe", "64": "nge existing categorizations and identify new categories that could enhance website navigation. Breaking down the project into three main steps, I began by identifying groups of products with similar descriptions. This involved preprocessing textual data to clean the corpus, encoding the texts with TF-IDF transformation, and training a clustering model using DBSCAN on the TF-IDF matrix. Subsequent", "65": "ly, I developed a recommender system by utilizing the cluster IDs obtained from the clustering model. This allowed me to suggest similar items to users based on their interests, enhancing the personalized shopping experience. Finally, I delved into topic modeling using an LSA model to automatically extract latent topics from the product descriptions. This involved training a TruncatedSVD model on ", "66": "the corpus and analyzing the results through wordclouds to gain insights into the underlying themes present in the product descriptions. In conclusion, the project aimed to leverage unsupervised machine learning techniques to optimize the online shopping experience for The North Face customers, potentially increasing conversion rates and overall sales on the company's website. Find the code in my ", "67": "GitHub.\nSkills: Machine Learning · Cluster AnalysisSkills: Machine Learning · Cluster Analysis\nUnsupervised ML (KMeans vs DBSCAN) - Hot zone clustering for taxi pick upUnsupervised ML (KMeans vs DBSCAN) - Hot zone clustering for taxi pick up\nAssociated with Jedha BootcampAssociated with Jedha Bootcamp\nI led a project at Uber focused on optimizing pickup locations through unsupervised machine-learn", "68": "ing techniques. The challenge we aimed to address was the inconvenience users faced when drivers weren't readily available in their vicinity, leading to longer wait times or ride cancellations.\nTo tackle this, my team and I developed algorithms to identify hot-zones in major cities, starting with New York City as our initial test bed. Leveraging Uber's extensive trip data, we employed clustering t", "69": "echniques, particularly KMeans and DBScan, to group pickup locations into clusters, thereby pinpointing areas of high demand at various times of the day.\n\n\nOur approach involved starting small, focusing on speciﬁc days and hours, before expanding to generalize our ﬁndings across diﬀerent timeframes. Using Python libraries like Plotly, we visualized these hot-zones on interactive maps, oﬀering a cl", "70": "ear understanding of where drivers should be positioned for optimal service.\nFind the code in my GitHub.I led a project at Uber focused on optimizing pickup locations through unsupervised machine-learning techniques. The challenge we aimed to address was the inconvenience users faced when drivers weren't readily available in their vicinity, leading to longer wait times or ride cancellations. To ta", "71": "ckle this, my team and I developed algorithms to identify hot-zones in major cities, starting with New York City as our initial test bed. Leveraging Uber's extensive trip data, we employed clustering techniques, particularly KMeans and DBScan, to group pickup locations into clusters, thereby pinpointing areas of high demand at various times of the day. Our approach involved starting small, focusin", "72": "g on speciﬁc days and hours, before expanding to generalize our ﬁndings across diﬀerent timeframes. Using Python libraries like Plotly, we visualized these hot-zones on interactive maps, oﬀering a clear understanding of where drivers should be positioned for optimal service. Find the code in my GitHub.\nSkills: Machine Learning · Cluster Analysis\n\n"}